In [ ]:
"""
COVERAGE 
(1)   Import data from file
(2)   Exploratory data analysis
      a.     Obtaining statistical summary
      b.     Plotting data to view patterns
(3)   Data cleaning
      a.     Detecting and addressing duplicates
      b.     Detecting and addressing missing values (replacing with value, with mean, mode, median)
(4)   Data analysis
      a.     Filtering
      b.     Adding and manipulating columns and rows
"""

In [ ]:
#import libraries
import numpy as np
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns

#### (1)Import data from file

In [ ]:

data = pd.read_csv('sample_data.csv')
data.head()
#data1 = pd.read_csv('sample_data1.csv')

In [ ]:
#Verify your dataset
#check number of values in dataset
print('Number of values in dataset: ', data.size)

In [ ]:
#check shape (number of rows and number of columns)
print('Number of rows and columns in dataset: ', data.shape)

In [ ]:
#check data types without \n
print('Data types in dataset are : ', data.dtypes)

In [ ]:
#check data types ..with \n to display values in the next line
print('Data types in dataset are : \n', data.dtypes)

In [ ]:
#check columns in dataset
print('Data columns in dataset are : \n', data.columns)

In [ ]:
data['Salary ']

In [ ]:
#rename column salary which has space
#two alternatives to make permanent changes
#(1)replace original dataset with changed copy
#data = data.rename(columns = {'Salary ':'Salary'})
#(2)use attribute inplace=True
data.rename(columns = {'Salary ':'Salary'}, inplace = True)

In [ ]:
#view information about dataset
#use of info()
#existance and number of null values and their columns
#view data types
data.info()

#### (2) Exploratory Data Analysis

In [ ]:
#Describe data using statistics
#Provides statistical summary of numerical data
data.describe()

In [ ]:
data1.describe()

In [ ]:
#Use boxplot or histogram to view outliers
sns.boxplot(data['Salary'])

In [ ]:
sns.boxplot(data1['Salary '])

In [ ]:
#kdata = pd.read_csv('kidney_disease.csv')

In [ ]:
data['Salary']

In [ ]:
#kdata.tail(20)

In [ ]:
data

#### (3) Data Cleaning

In [ ]:
#(1) Removing outliers (extreme values which distort dataset statistics)
#(2) Removind duplicates
#(3) Filling missing values
#(4) Modify data to required format M=male, F=female      Male

In [ ]:
#Remove outliers
#I can remove data with salary below 15,000 and above 30,000
filter = (data['Salary'] > 15000) & (data['Salary'] < 30000)

In [ ]:
data[filter]

In [ ]:
data = data[(data['Salary'] > 15000) & (data['Salary'] < 30000)]

In [ ]:
sns.boxplot(data['Salary'])

In [ ]:
data

In [ ]:
#removing duplicates
#detect 
data.duplicated()

In [ ]:
#remove
data = data.drop_duplicates()

In [ ]:
data

In [ ]:
#(3) Filling missing values   (represented by NaN in pandas)
#detect
data.isna()  #returns True whenever there is a missing values

In [ ]:
#detect columns with missing values
data.isna().any()

In [ ]:
kdata = pd.read_csv('kidney_disease.csv')

In [ ]:
kdata.isna().any()

In [ ]:
#detect if dataset has missing values in one or more columns
data.isna().any().any()

In [ ]:
kdata.isna().any().any()

In [ ]:
#count missing values in one or more columns
data.isna().sum()

In [ ]:
kdata.isna().sum()

In [ ]:
#number of columns with missing values
data.isna().any().sum()

In [ ]:
#number of columns with missing values
kdata.isna().any().sum()

In [ ]:
data.isna().any().count()

In [ ]:
kdata.isna().any().count()

In [ ]:
data

In [ ]:
#treatment of missing values (1) delete (2)  find and insert values (3) replace them
#Depends on data types
#Numeric = fill with values, mean or median
#Alphabetic = mode

In [ ]:
#replace with fillna function
#replace with value
data['Salary '] = data[['Salary ']].fillna(20000)

In [ ]:
data

In [ ]:
data = pd.read_csv('sample_data.csv')

In [ ]:
#replace with mean
data['Salary '] = data[['Salary ']].fillna(data['Salary '].mean())

In [ ]:
data

In [186]:
#replace with mean
data = pd.read_csv('sample_data.csv')
data['Salary '] = data[['Salary ']].fillna(data['Salary '].median())

In [187]:
#replace with mode
#data = pd.read_csv('sample_data.csv')
data['Qualification'] = data['Qualification'].fillna(data['Qualification'].mode())
data

   Serial Number                      Title  Salary  Qualification
0              1          Software Engineer  50000.0     Bachelors
1              2             Data Scientist  23000.0       Masters
2              3            Project Manager  18000.0       Masters
3              4                  Professor  25000.0     Doctorate
4              5         Database Architect  17000.0     Bachelors
5              6  Machine Learning Engineer  19000.0       Masters
6              7           Business Analyst  18000.0           NaN
7              8            UX/UI Developer     23.0     Bachelors
8              9            Devops Engineer  18500.0       Masters

In [ ]:
data.columns

#### (4) Add or manipulate columns

In [189]:
#column manipulation using lambda function
data['prev_salary'] = data['Salary '].apply(lambda m: m + 10000)
data

,Serial Number,Title,Salary,Qualification,prev_salary
0,1,Software Engineer,50000.0,Bachelors,60000.0
1,2,Data Scientist,23000.0,Masters,33000.0
2,3,Project Manager,18000.0,Masters,28000.0
3,4,Professor,25000.0,Doctorate,35000.0
4,5,Database Architect,17000.0,Bachelors,27000.0
5,6,Machine Learning Engineer,19000.0,Masters,29000.0
6,7,Business Analyst,18000.0,NaN,28000.0
7,8,UX/UI Developer,23.0,Bachelors,10023.0
8,9,Devops Engineer,18500.0,Masters,28500.0

In [190]:
#Manipulate multiple columns using a function
#function
def salary_growth(salary, prev_salary):
    return prev_salary/salary * 100

In [191]:
#testing function
salary_growth(30,25)

83.33333333333334

In [192]:
#data manipulation
data['sal_growth'] = salary_growth(data['Salary '],data['prev_salary']) 
data

,Serial Number,Title,Salary,Qualification,prev_salary,sal_growth
0,1,Software Engineer,50000.0,Bachelors,60000.0,120.000000
1,2,Data Scientist,23000.0,Masters,33000.0,143.478261
2,3,Project Manager,18000.0,Masters,28000.0,155.555556
3,4,Professor,25000.0,Doctorate,35000.0,140.000000
4,5,Database Architect,17000.0,Bachelors,27000.0,158.823529
5,6,Machine Learning Engineer,19000.0,Masters,29000.0,152.631579
6,7,Business Analyst,18000.0,NaN,28000.0,155.555556
7,8,UX/UI Developer,23.0,Bachelors,10023.0,43578.260870
8,9,Devops Engineer,18500.0,Masters,28500.0,154.054054